/*
 BrandMessengerLocalizable.strings
 BrandMessenger
 
 Copyright (c) 2015 Smooch Technologies. All rights reserved.
 */

/* Nav bar button, action sheet cancel button */
"Cancel" = "Cancel";

/* Conversation title */
"Messages" = "Messages";

/* Conversation header. Uses CFBundleDisplayName */
"This is the start of your conversation with the %@ team. We'll stay in touch to help you get the most out of your app.\nFeel free to leave us a message about anything that’s on your mind. We’ll get back to your questions, suggestions or anything else as soon as we can." = "This is the start of your conversation with the %@ team. We'll stay in touch to help you get the most out of your app.\nFeel free to leave us a message about anything that’s on your mind. We’ll get back to your questions, suggestions or anything else as soon as we can.";

/* Conversation header when there are previous messages */
"Show more..." = "Show more...";

/* Conversation header when fetching previous messages */
"Retrieving history..." = "Retrieving history...";

/* Error message shown in conversation view */
"No Internet connection" = "No Internet connection";

/* Error message shown in conversation view */
"Could not connect to server" = "Could not connect to server";

/* Error message shown in conversation view */
"An error occurred while processing your action. Please try again." = "An error occurred while processing your action. Please try again.";

/* Error message shown in conversation view */
"Reconnecting..." = "Reconnecting...";

/* Error message shown in conversation view */
"Invalid file" = "Invalid file";

/* Error message shown in conversation view */
"A virus was detected in your file and it has been rejected" = "A virus was detected in your file and it has been rejected";

/* Error message shown in conversation view. Parameter represents the max file size formatted by NSByteCountFormatter */
"Max file size limit exceeded %@." = "Max file size limit exceeded %@.";

/* Fallback used by the in app notification when no message author name is found */
"%@ Team" = "%@ Team";

/* Conversation send button */
"Send" = "Send";

/* Conversation text input place holder */
"Type a message..." = "Type a message...";

/* Conversation nav bar left button */
"Done" = "Done";

/* Failure text for chat messages that fail to upload */
"Message not delivered. Tap to retry." = "Message not delivered. Tap to retry.";

/* Failure text for user notification replies that fail to upload */
"Message not delivered. Please try again later." = "Message not delivered. Please try again later.";

/* Status text for chat messages */
"Sending..." = "Sending...";

/* Status text for sent chat messages */
"Delivered" = "Delivered";

/* Status text for chat messages seen by the business */
"Seen" = "Seen";

/* Timestamp text for recent messages */
"Just now" = "Just now";

/* Timestamp text for messages in the last hour */
"%.0fm ago" = "%.0fm ago";

/* Timestamp text for messages in the last day */
"%.0fh ago" = "%.0fh ago";

/* Timestamp text for messages in the last week */
"%.0fd ago" = "%.0fd ago";

/* Action sheet button label */
"Take Photo" = "Take a Quick Photo";

/* Action sheet button label */
"Photo & Video Library" = "Photo & Video Library";

/* Action sheet button label */
"Upload Document" = "Upload Document";

/* Action sheet button label */
"Share Location" = "Share Location";

/* Photo confirmation alert title */
"Confirm Photo" = "Confirm Photo";

/* Action sheet button label */
"Resend" = "Resend";

/* Action sheet button label */
"View Image" = "View Image";

/* Message displayed in message bubble when image is not available */
"Tap to view%@ image" = "Tap to view%@ image";

/* Message displayed in message bubble when image is not available */
"Preview not available" = "Preview not available";

/* Error displayed in message bubble if image failed to download */
"Tap to reload image" = "Tap to reload image";

/* Error displayed as message if location sending fails */
"Could not send location" = "Could not send location";

/* Message displayed for unknown message types */
"Unsupported message type" = "Unsupported message type";

/* Message displayed for unknown action types */
"Unsupported action type" = "Unsupported action type";

/* Title displayed for unknown action types */
"Error" = "Error";

/* Error title when user selects "use latest photo", but no photos exist */
"No Photos Found" = "No Photos Found";

/* Error description when user selects "use latest photo", but no photos exist */
"Your photo library seems to be empty." = "Your photo library seems to be empty.";

/* Error title when user attempts to upload a photo but Photos access is denied */
"Can't Access Photos" = "Can't Access Photos";

/* Error description when user attempts to upload a photo but Photos access is denied */
"Make sure to allow photos access for this app in your privacy settings." = "Make sure to allow photos access for this app in your privacy settings.";

/* Error title when user attempts to take a photo but camera access is denied */
"Can't Access Camera" = "Can't Access Camera";

/* Error description when user attempts to take a photo but camera access is denied */
"Make sure to allow camera access for this app in your privacy settings." = "Make sure to allow camera access for this app in your privacy settings.";

/* Generic error title when user attempts to upload an image and it fails for an unknown reason */
"Can't Retrieve Photo" = "Can't Retrieve Photo";

/* Generic error description when user attempts to upload an image and it fails for an unknown reason */
"Please try again or select a new photo." = "Please try again or select a new photo.";

/* Error title when user attempts to send the current location but location access is denied */
"Can't Access Location" = "Can't Access Location";

/* Error description when user attempts to send the current location but location access is denied */
"Make sure to allow location access for this app in your privacy settings." = "Make sure to allow location access for this app in your privacy settings.";

/* UIAlertView button title to link to Settings app */
"Settings" = "Settings";

/* UIAlertView button title to dismiss */
"Dismiss" = "Dismiss";

/* Title for payment button */
"Pay Now" = "Pay Now";

/* Title for message action when payment completed */
"Payment Completed" = "Payment Completed";

/* 
 Instructions for entering credit card info. Parameters are as follows:
 1. Amount (e.g. 50.45)
 2. Currency (e.g. USD)
 3. App name (Uses CFBundleDisplayName)
*/
"Enter your credit card to send $%@ %@ securely to %@" = "Enter your credit card to send $%@ %@ securely to %@";

/* Error text when payment fails */
"An error occurred while processing the card. Please try again or use a different card." = "An error occurred while processing the card. Please try again or use a different card.";

/* Button label for saved credit card view */
"Change Credit Card" = "Change Credit Card";

/*
 Information label for saved credit card view. Parameters are as follows:
 1. Amount (e.g. 50.45)
 2. Currency (e.g. USD)
 3. App name (Uses CFBundleDisplayName)
 */
"You're about to send $%@ %@ securely to %@" = "You're about to send $%@ %@ securely to %@";

/* Title for user notification action */
"Reply" = "Reply";

/* Date format used for message grouping headers on the conversation screen */
"MMMM d, h:mm a" = "MMMM d, h:mm a";

/* Date format used for message timestamps on the conversation screen */
"hh:mm a" = "hh:mm a";

/* Error message when the content of a webview fails to load */
"Failed to open the page" = "Failed to open the page";

/* Timestamp text for messages received in the last minute on the conversation screen */
"1 minute ago" = "1 minute ago";

/* Timestamp text for messages received between 1 minute and 1 hour ago on the conversation screen */
"%ld minutes ago" = "%ld minutes ago";

/* Timestamp text for messages received between 1 and 2 hours ago on the conversation screen */
"1 hour ago" = "1 hour ago";

/* Timestamp text for messages received between 2 and 24 hours ago on the conversation screen */
"%ld hours ago" = "%ld hours ago";

/* Timestamp text for messages received between 24 and 48 hours ago on the conversation screen */
"Yesterday" = "Yesterday";

/* Conversation list title */
"My Conversations" = "My Conversations";

/* Conversation list empty view text */
"No conversations" = "No conversations";

/* Text used in the unread badge when there are more than 9 unread messages */
"9+" = "9+";

/* Text used as a preview when a file is sent */
"%@ sent a file" = "%@ sent a file";

/* Text used as a preview when a image is sent */
"%@ sent an image" = "%@ sent an image";

/* Text used as a preview when a form is sent */
"%@ sent a form" = "%@ sent a form";

/* Text used as a preview when some other message type that is not file, image, form or text is sent */
"%@ sent a message" = "%@ sent a message";

/* Text used as a preview when no message has been sent */
"No Messages" = "No Messages";

/* Text used as a prefix by messages sent by the current app user. */
"You" = "You";

/* Text used to notify user an error has occured loading a conversation from the conversation list screen. */
"Failed to load conversation" = "Failed to load conversation";

/* Create Conversation Button Title */
"Create conversation" = "New conversation";

/* Text used to notify user an error has occured creating a conversation from the conversation list screen. */
"Failed to create conversation" = "Failed to create conversation";
